---
kind: method
id: M:Autodesk.Revit.DB.ParameterFilterRuleFactory.Dispose
source: html/ee6548d9-019c-cf6d-e4c2-0a275f83bea3.htm
---
# Autodesk.Revit.DB.ParameterFilterRuleFactory.Dispose Method

Releases all resources used by the ParameterFilterRuleFactory

## Syntax (C#)
```csharp
public void Dispose()
```